       IDENTIFICATION DIVISION.
       PROGRAM-ID. NOMBRE-PROGRAMA.
       
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * Variables del programa
           01 WS-EJEMPLO       PIC X(10) VALUE SPACES.
       
       PROCEDURE DIVISION.
       
       PRINCIPAL.
           DISPLAY "Iniciando programa...".
           
           STOP RUN.
       
       END PROGRAM NOMBRE-PROGRAMA.