       IDENTIFICATION DIVISION.
       PROGRAM-ID. LaboratorioDia6.

       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01  WS-WORK-AREAS.
           05  WS-OP                   PIC X(1).
               88  OP-ENG              VALUE 1.
               88  OP-BUS              VALUE 2.
               88  OP-IST              VALUE 3.
               88  OP-SCI              VALUE 4.
           05  WS-SUM                  PIC 9(5)V9(2).
           05  WS-PROM                 PIC 9(2)V9(2).
           05  WS-PROM-TOTAL           PIC 9(2)V9(2).
           05  WS-PROM-ENG             PIC 9(2)V9(2).
           05  WS-PROM-BUS             PIC 9(2)V9(2).
           05  WS-PROM-IST             PIC 9(2)V9(2).
           05  WS-PROM-SCI             PIC 9(2)V9(2).

       01  DB-CONN.
           05  DB-USER                 PIC X(20) VALUE 'root'.
           05  DB-PASSWORD             PIC X(20) VALUE 'T.bobby02'.
           05  DB-NAME                 PIC X(20) VALUE 'Laboratorio'.
           05  DB-HOST                 PIC X(20) VALUE 'localhost'.
           05  DB-PORT                 PIC 9(5)  VALUE 3306.

           EXEC SQL
               BEGIN DECLARE SECTION
           END-EXEC
       01  DB-VARS.
           05  BUFFER                  PIC X(1024).
           05  CLASE-MENU              PIC X(3).
           05  STUDENT.
               10  IDE                 PIC 9(7).
               10  APELL               PIC X(10).
               10  NOMB                PIC X(10).
               10  CLASCOD             PIC X(9).
               10  CLAS                PIC X(3).
               10  NOTA1               PIC 9(2)V9(2).
               10  NOTA2               PIC 9(2)V9(2).
               10  NOTA3               PIC 9(2)V9(2).
               10  PROMEDIO            PIC 9(2)V9(2).
           EXEC SQL
               END DECLARE SECTION
           END-EXEC



       PROCEDURE DIVISION.
           PERFORM 0100-INICIO.
           PERFORM 0200-PROCESO.
           PERFORM 0300-FIN.

       0100-INICIO.

           INITIALIZE WS-WORK-AREAS.


      *-----------------------------------------------------------------*
      * CONNECT TO THE DATABASE
      * also possible with DSN: 'youruser/yourpasswd@yourODBC_DSN'
      *-----------------------------------------------------------------*
           STRING  'DRIVER={MySQL ODBC 8.0 ANSI Driver};'
                   'SERVER=',DB-HOST,';'
                   'PORT=',DB-PORT,';'
                   'DATABASE=',DB-NAME,';'
                   'USER=',DB-USER,';'
                   'PASSWORD=',DB-PASSWORD,';'
      * example for DB specific ODBC parameter:
      * no compressed MySQL connection (would be the DEFAULT anyway)
                   'COMRESSED_PROTO=0;'
                   INTO BUFFER.
           EXEC SQL
               CONNECT TO :BUFFER
           END-EXEC
           PERFORM SQLSTATE-CHECK.
      *-----------------------------------------------------------------*



       0200-PROCESO.

           PERFORM 0210-SELECT-NOTAS-CURSOR.
           PERFORM 0230-CALC-PROMEDIO.
           PERFORM 0240-COMMIT-SQL.
           PERFORM 0250-MENU.



       0210-SELECT-NOTAS-CURSOR.
      *-----------------------------------------------------------------*
      * Lectura tabla en DB con cursor
      *-----------------------------------------------------------------*
           EXEC SQL
               DECLARE CUR_ALL CURSOR FOR
               SELECT
               ID,
               NOTA1,
               NOTA2,
               NOTA3,
               PROMEDIO
               FROM
               NOTAS
           END-EXEC
           PERFORM SQLSTATE-CHECK.


       0220-INSERTAR-PROMEDIO.
      *-----------------------------------------------------------------*
      * INSERTA PROMEDIO DEL ESTUDIANTE
      *-----------------------------------------------------------------*
           EXEC SQL
               UPDATE NOTAS
               SET PROMEDIO = :PROMEDIO
               WHERE ID = :IDE
           END-EXEC
           PERFORM SQLSTATE-CHECK.

       0230-CALC-PROMEDIO.
           EXEC SQL
               OPEN CUR_ALL
           END-EXEC
           PERFORM SQLSTATE-CHECK.
           PERFORM UNTIL SQLCODE = 100
               EXEC SQL
                   FETCH CUR_ALL
                   INTO
                       :IDE,
                       :NOTA1,
                       :NOTA2,
                       :NOTA3,
                       :PROMEDIO
               END-EXEC
               PERFORM SQLSTATE-CHECK
               IF SQLCODE NOT = 100
                   COMPUTE WS-SUM = NOTA1 + NOTA2 + NOTA3
                   COMPUTE WS-PROM = WS-SUM/3
                   MOVE WS-PROM TO PROMEDIO
                   PERFORM 0220-INSERTAR-PROMEDIO
               END-IF
           END-PERFORM.
           EXEC SQL
               CLOSE CUR_ALL
           END-EXEC.

       0240-COMMIT-SQL.
      *-----------------------------------------------------------------*
      * COMMIT CHANGES
      *-----------------------------------------------------------------*
           EXEC SQL
               COMMIT
           END-EXEC
           PERFORM SQLSTATE-CHECK.

       0250-MENU.
           DISPLAY "-----------------------------------------".
           DISPLAY "ESCOJA LA CLASE PARA VER SU RESUMEN (1-4): ".
           DISPLAY "1: ENG    2:BUS    3:IST    4:SCI".
           ACCEPT WS-OP.
           EVALUATE TRUE
               WHEN OP-ENG
                   PERFORM 0260-OP-ENG
               WHEN OP-BUS
                   PERFORM 0270-OP-BUS
               WHEN OP-IST
                   PERFORM 0280-OP-IST
               WHEN OP-SCI
                   PERFORM 0290-OP-SCI
           END-EVALUATE.

       0255-SELECT-CLASE.
           EXEC SQL
               DECLARE CUR_CLASE CURSOR FOR
               SELECT
               ESTUDIANTES.ID,
               ESTUDIANTES.APELLIDO,
               ESTUDIANTES.NOMBRE,
               NOTAS.NOTA1,
               NOTAS.NOTA2,
               NOTAS.NOTA3,
               NOTAS.PROMEDIO
               FROM ESTUDIANTES
               JOIN NOTAS ON ESTUDIANTES.ID = NOTAS.ID
               WHERE ESTUDIANTES.CLASE=:CLASE-MENU
           END-EXEC
           PERFORM SQLSTATE-CHECK.

       0260-OP-ENG.
           MOVE "ENG" TO CLASE-MENU.
           PERFORM 0255-SELECT-CLASE.
           EXEC SQL
               OPEN CUR_CLASE
           END-EXEC
           PERFORM SQLSTATE-CHECK.
           PERFORM UNTIL SQLCODE = 100
               EXEC SQL
                   FETCH CUR_CLASE
                   INTO
                       :IDE,
                       :APELL,
                       :NOMB,
                       :NOTA1,
                       :NOTA2,
                       :NOTA3,
                       :PROMEDIO
               END-EXEC
               PERFORM SQLSTATE-CHECK
               IF SQLCODE NOT = 100
                   DISPLAY IDE " " APELL " " NOMB " " NOTA1 " " NOTA2
                           " " NOTA3 " " PROMEDIO
               END-IF
           END-PERFORM.
           EXEC SQL
               CLOSE CUR_CLASE
           END-EXEC.

       0270-OP-BUS.
           MOVE "BUS" TO CLASE-MENU.
           PERFORM 0255-SELECT-CLASE.
           EXEC SQL
               OPEN CUR_CLASE
           END-EXEC
           PERFORM SQLSTATE-CHECK.
           PERFORM UNTIL SQLCODE = 100
               EXEC SQL
                   FETCH CUR_CLASE
                   INTO
                       :IDE,
                       :APELL,
                       :NOMB,
                       :NOTA1,
                       :NOTA2,
                       :NOTA3,
                       :PROMEDIO
               END-EXEC
               PERFORM SQLSTATE-CHECK
               IF SQLCODE NOT = 100
                   DISPLAY IDE " " APELL " " NOMB " " NOTA1 " " NOTA2
                           " " NOTA3 " " PROMEDIO
               END-IF
           END-PERFORM.
           EXEC SQL
               CLOSE CUR_CLASE
           END-EXEC.

       0280-OP-IST.
           MOVE "IST" TO CLASE-MENU.
           PERFORM 0255-SELECT-CLASE.
           EXEC SQL
               OPEN CUR_CLASE
           END-EXEC
           PERFORM SQLSTATE-CHECK.
           PERFORM UNTIL SQLCODE = 100
               EXEC SQL
                   FETCH CUR_CLASE
                   INTO
                       :IDE,
                       :APELL,
                       :NOMB,
                       :NOTA1,
                       :NOTA2,
                       :NOTA3,
                       :PROMEDIO
               END-EXEC
               PERFORM SQLSTATE-CHECK
               IF SQLCODE NOT = 100
                   DISPLAY IDE " " APELL " " NOMB " " NOTA1 " " NOTA2
                           " " NOTA3 " " PROMEDIO
               END-IF
           END-PERFORM.
           EXEC SQL
               CLOSE CUR_CLASE
           END-EXEC.

       0290-OP-SCI.
           MOVE "SCI" TO CLASE-MENU.
           PERFORM 0255-SELECT-CLASE.
           EXEC SQL
               OPEN CUR_CLASE
           END-EXEC
           PERFORM SQLSTATE-CHECK.
           PERFORM UNTIL SQLCODE = 100
               EXEC SQL
                   FETCH CUR_CLASE
                   INTO
                       :IDE,
                       :APELL,
                       :NOMB,
                       :NOTA1,
                       :NOTA2,
                       :NOTA3,
                       :PROMEDIO
               END-EXEC
               PERFORM SQLSTATE-CHECK
               IF SQLCODE NOT = 100
                   DISPLAY IDE " " APELL " " NOMB " " NOTA1 " " NOTA2
                           " " NOTA3 " " PROMEDIO
               END-IF
           END-PERFORM.
           EXEC SQL
               CLOSE CUR_CLASE
           END-EXEC.

       0300-FIN.

      *-----------------------------------------------------------------*
      * DISCONNECT FROM THE DATABASE
      *-----------------------------------------------------------------*
           EXEC SQL
               CONNECT RESET
           END-EXEC
           PERFORM SQLSTATE-CHECK.
      *-----------------------------------------------------------------*

           STOP RUN.

      *-----------------------------------------------------------------*
      * REVISA SQLSTATE E IMPRIME ERRORES SI EXISTEN
      *-----------------------------------------------------------------*
       SQLSTATE-CHECK.
           IF SQLCODE < 0
               DISPLAY 'SQLSTATE='  SQLSTATE,
                       ', SQLCODE=' SQLCODE
               IF SQLERRML > 0
                   DISPLAY 'SQL Error message:' SQLERRMC(1:SQLERRML)
               END-IF
               MOVE SQLCODE TO RETURN-CODE
               STOP RUN
           ELSE
               IF SQLCODE > 0 AND NOT = 100
                   DISPLAY 'SQLSTATE='  SQLSTATE,
                           ', SQLCODE=' SQLCODE
                   IF SQLERRML > 0
                       DISPLAY 'SQL Warning message:'
                               SQLERRMC(1:SQLERRML)
                   END-IF
               END-IF.
