           SELECT ARCHIVO-ESTUDIANTES ASSIGN TO "STUDENTS.DAT"
               FILE STATUS IS ESTADO-ARCHIVO
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT ARCHIVO-ORDENADO ASSIGN TO "NUEVOS_ESTUDIANTES.DAT"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT ARCHIVO-TRABAJO ASSIGN TO "TRABAJO.TMP".
